Examples/ConservativeDBSPaper/DNS/Bentheimer_400cube/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   inlet 
    {
        type            fixedValue;
        value           uniform deltaP;
    }

   outlet 
    {
        type            fixedValue;
        value           uniform 0;
    }

    walls 
    {
        type            zeroGradient;
    }


   solidwalls
   {
        type            zeroGradient;
   }


}


// ************************************************************************* //
