Examples/ConservativeDBSPaper/DNS/Bentheimer_400cube/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

direction 0;

x1 0;
x2 .002000;

y1 0;
y2 .002000;

z1 0;
z2 .002000;

inletName inlet;

outletName outlet;

velocity volumeAveraged;
pressureDrop direct;


////velocity: volumeAveraged or inlet
////pressure: direct or velocityWeightedAverageGradient or velocityWeightedAverageViscousForce or momentumSource
