Examples/ConservativeDBSPaper/DNS/Bentheimer_400cube/Allrun.sh
./createMesh.sh
./initCaseFlow.sh
./runCaseFlow.sh
./processFlow.sh
